<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <title>html_clean_sheet</title>
  </head>
  <body>
    <h2>a - Hyperlinks</h2>
    <p>
      Sirven para hacer un link de una p&aacute;gina a otro recurso en la web,
      sea otro archivo en el servidor web, u otra p&aacute;gina web.
    </p>
    <p>
      Por ejemplo:
      <a href="https://tinyurl.com/4wnrkkzx"
        >El siguiente link muestra un video de c&oacute;mo funcionan los
        hyperlinks!</a
      >
    </p>

    <h2>p - Paragraph</h2>
    <p>
        Sirve para crear un nuevo p&aacute;rrafo.
    </p>
    <p>
        Por ejemplo:
        <p>
            Este texto es el ejemplo de un nuevo p&aacute;rrafo.
        </p>
    </p>

    <h2> h1, h2, h3, h4, h5, h6 - Headings</h2>
    <p>
        Sirven para definir distintos tipos de encabezados desde el 1 hasta el 6.
    </p>
    <p>
        Por ejemplo: 
        <h1> Encabezado de nivel 1</h1>
        <h2> Encabezado de nivel 2</h2>
        <h3> Encabezado de nivel 3</h3>
        <h4> Encabezado de nivel 4</h4>
        <h5> Encabezado de nivel 5</h5>
        <h6> Encabezado de nivel 6</h6>
    </p>

    <h2>div - Division</h2>
    <p>
        Sirve como un contenedor que divide el documento HTML en secciones para prop&oacute;sitos de estilarlo.
    </p>
    <p>
        Por ejemplo: <div>Esto es una secci&oacute;n.</div>
    </p>

    <h2>span - Inline Container</h2>
    <p>
        Sivre como un contenedor dentro de la l&iacute;nea para el texto, con el fin the agruparlo y poder estilarlo.
    </p>
    <p>
        Por ejemplo: <span style="color: green;">Este es el ejemplo</span>
    </p>

    <h2>strong - Strong</h2>
    <p>
        Se usa sem&aacute;nticamente para resaltar la importancia en un texto y el navegador lo mostrar&aacute; en negritas de forma predeterminada.
    </p>
    <p>
        <strong>Por ejemplo: Este texto</strong>
    </p>

    <h2>i - Italics</h2>
    <p>
        Sivre para crear texto en it&aacute;licas. Se usa sem&aacute;nticamente para transmitir texto en un tono o voz alternativo, como si se utilizaran comillas. 
    </p>
    <p>
        <i>Por ejemplo: Este texto.</i>
    </p>

    <h2>u - Underline</h2>
    <p>
        Sirve para definir un texto subrayado.
    </p>
    <p>
        <u> Por ejemplo: Este texto</u>
    </p>

    <h2>b - Bold Text</h2>
    <p>
        Sivre para convertir un texto a negritas y poner una importancia en el mismo. Sem&aacute;nticamente, este se utiliza con prop&oacute;sitos estil&iacute;sticos para texto desplazado.
    </p>
    <p>
        <b> Por ejemplo: </b> Este <b> texto.</b>
    </p>

    <h2>strike - Strikethrough</h2>
    <p> 
        Sirve para tachar texto
    </p>
    <p>
        <strike> Por ejemplo: Este texto.</strike>
    </p>

    <h2>small - Small</h2>
    <p>
        Sem&aacute;nticamente, representa comentarios y los escribe de forma pequeña.
    </p>
    <p>
        <small>Por ejemplo: Este texto</small>
    </p>

    <h2>em - Italics</h2>
    <p>
        Sem&aacute;nticamente se utiliza para hacer &eacute;nfasis en el texto y lo pone en cursivas. 
    </p>
    <p>
        <em> Por ejemplo: Este texto.</em>
    </p>

    <h2>header - Header</h2>
    <p>
        Sirve para identificar la parte de arriba de una p&aacute;gina, art&iacute;culo, secci&oacute;n o segmento de una p&aacute;gina. Este puede incluir el t&iacute;tulo, texto introductorio, etc.
    </p>
    <p>
        <header>Esto es un ejemplo de un Header</header>
    </p>

    <h2>section - Section</h2>
    <p>
        Sirve para identificar un grupo de contenido con la misma tem&aacute;tica, el cual ingluye, generalmente, un encabezado. 
    </p>
    <p>
        Por ejemplo: <section><h2>F&uacute;tbol</h2><p>Mbappe va a fichar por el Real Madrid.</p></section>
    </p>

    <h2>article - Article</h2>
    <p>
        Sirve para identificar una secci&oacute;n que contiene contenido independiente. Generalmente, se utiliza para marcar posts de blogs, art&iacute;culos de peri&oacute;dico, contenido ingresado por el usuario, etc.
    </p>
    <p>
        Por ejemplo: <article><h2>Art&iacute;culo: </h2><p>Este es el ejemplo</p></article>
    </p>

    <h2>aside - Aside</h2>
    <p>
        Guarda contenido como bototnes de insertar, pequeñas explicaciones o sidebars que est&aacute;n relacionadas con el contenido que lo rodea.
    </p>
    <p>
        <aside>Por ejemplo: Una sidebar</aside>
    </p>

    <h2>footer - Footer</h2>
    <p>
        Sirve para identificar el cierre o el final de la p&aacute;gina, art&iacute;culo, etc.
    </p>
    <p>
        <footer>Por ejemplo: Copyright &copy; 2024. </footer>
    </p>

    <h2>nav - Navigation</h2>
    <p>
        Sirve para identificar una secci&oacute;n con muchos enlaces de navegaci&oacute;n.
    </p>
    <p>
        Por ejemplo: <nav>
            <a href="index.html">Home</a>
            <a href="speakers.html">Speakers</a>
            <a href="schedule.html">Schedule</a>
            <a href="venue.html">Venue</a>
            <a href="register.html">Register</a>
        </nav>
    </p>

    <h2>img - Image</h2>
    <p>
        Sirve para insertar im&aacute;genes en el documento.
    </p>
    <p>
        Por ejemplo: <img src="https://www.laprensa.hn/binrepository/918x900/0c0/0d0/none/11004/VRVU/mbappe-real-madrid_4845092_20230622163448.jpg">
    </p>

    <h2>br - BreakLine</h2>
    <p>
        Sirve para realizar un salto de l&iacute;nea, sin necesidad de utilizar un nuevo p&aacute;rrafo.
    </p>
    <p>
        Por ejemplo: Primera l&iacute;nea. <br /> Segunda l&iacute;nea.
    </p>

    <h2>hr - Horizontal Rule</h2>
    <p>
        Sirve para insertar una l&iacute;nea horizontal en el documento. 
    </p>
    <p>
        Por ejemplo: <hr /> La l&iacute;nea antes de este texto. 
    </p>

    <h2>form - Form</h2>
    <p>
        Sirve para crear un formulario en el documento, el cual el usuario podr&aacute; rellenar y enviar.
    </p>
    <p>
        Por ejemplo:
        <form>
            Nombre: <input type="text" name="nombre">
            <input type="submit" value="Enviar">
        </form>
    </p>

    <h2>table - Table</h2>
    <p>
        Sirve para crear tablas y mostrar informaci&oacute;n en la misma.
    </p>
    <p>
        Por ejemplo:
        <table border="1">
            <tr>
                <th>Nombre</th>
                <th>Apellido</th>
                <th>Pa&iacute;s</th>
            </tr>
            <tr>
                <th>Paul</th>
                <th>Araque</th>
                <th>Venezuela</th>
            </tr>
            <tr>
                <th>Juan</th>
                <th>Perez</th>
                <th>Mexico</th>
            </tr>
        </table>
    </p>

    <h2>ul - Unordered List</h2>
    <p>
        Sirve para crear una lista sin orden espec&iacute;fico.
    </p>
    <p>
        Por ejemplo:
        <ul>
            <li>Futbol</li>
            <li>Tennis</li>
            <li>Baseball</li>
        </ul>
    </p>

    <h2>ol - Ordered List</h2>
    <p>
        Sirve para crear una lista con un orden espec&iacute;fico.
    </p>
    <p>
        Por ejemplo:
        <ol>
            <li>Futbol</li>
            <li>Baseball</li>
            <li>Tennis</li>
        </ol>
    </p>

  </body>
</html>
